RhinoInside.Revit API Documentation
GeometryDecoder.ToVector2d Method
 Converts the specified UV vector to an equivalent Rhino Vector2d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Rhino.Geometry.Vector2d ToVector2d(
	this Autodesk.Revit.DB.UV value
)
@staticmethod
def ToVector2d(
	value: Autodesk.Revit.DB.UV
) -> Rhino.Geometry.Vector2d
Parameters
value
Type: Autodesk.Revit.DB.UV
A value to convert.
Return Value
Type: Rhino.Geometry.Vector2d
A Rhino Vector2d that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.UV. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace